Repository: ibanner/ibannerizer-reali
Catalog: languages/efw-alumni-*.po
Languages: he_il

source: Grad Year
he_il: שנת סיום

source: Hebrew Year
he_il: שנה עברית

source: Panmaz Class
he_il: מחזור פנמ"צ

# Award Ordering
source: Order
he_il: סדר

source: Award Recipient
he_il: מקבל.ת הפרס

source: Featured Image
he_il: תמונה

source: Award Year
he_il: שנה

source: Award Link
he_il: קישור מידע

# Award Link
source: Open
he_il: פתיחה

source: Claiming User Data
he_il: נתוני בוגר.ת משויך.ת

source: Email
he_il: דוא"ל

source: Claimed Alumnus ID
he_il: מזהה בוגר.ת משויך.ת

source: Claimed Alumnus URL
he_il: כתובת עמוד בוגר.ת משויך.ת

source: Claimed Alumnus Name
he_il: שם בוגר.ת משויך.ת

source: Email Consent
he_il: הסכמה לדיוור

source: Has Shared Data
he_il: שיתף/ה מידע

source: Current Photo ID
he_il: מזהה תמונה עדכנית

source: Phone Number
he_il: מספר טלפון

source: User Bio
he_il: ביוגרפיה של המשתמש

source: Website URL
he_il: קישור לאתר

source: Facebook URL
he_il: קישור פייסבוק

source: Twitter URL
he_il: קישור טוויטר

source: LinkedIn URL
he_il: קישור לינקדאין

source: Instagram URL
he_il: קישור אינסטגרם

source: Claiming User Photo
he_il: תמונת בוגר.ת משויך.ת

source: Alumni Name Format
he_il: פורמט שמות

source: Original full name
he_il: שם מלא מקורי

source: Current full name
he_il: שם מלא כיום

source: Format
he_il: פורמט

source: Nickname?
he_il: כינוי?

source: Include
he_il: לכלול

source: Don't include
he_il: לא לכלול

source: RIP
he_il: ז"ל

source: Claiming User Names
he_il: שמות בוגר.ת משויך.ת

source: Override
he_il: לתעדף

source: Ignore
he_il: להתעלם

source: Log-in/Log-out URL
he_il: קישור כניסה/יציאה

source: Redirect
he_il: הפנייה

source: Homepage
he_il: עמוד הבית

source: Current page
he_il: דף נוכחי

source: EFW Utility Tags
he_il: תגיות EFW

# Feminine
source: Israel Prize Laureate
he_il: כלת פרס ישראל

# Masculine
source: Israel Prize Laureate
he_il: חתן פרס ישראל

# Gender Neutral
source: Israel Prize Laureate
he_il: פרס ישראל

source: Did you mean:
he_il: ייתכן שהתכוונת ל:

source: Alumnus not found
he_il: בוגר.ת לא נמצא.ה

# Israel Prize
source: %1$s for %2$s in %3$d
he_il: %1$s ב%2$s לשנת %3$d

# Masculine
source: Graduated in
he_il: בוגר

# Feminine
source: Graduated in
he_il: בוגרת

# Gender Neutral
source: Graduated in
he_il: בוגר.ת

# Masculine
source: Studied with
he_il: למד עם

# Feminine
source: Studied with
he_il: למדה עם

# Gender Neutral
source: Studied with
he_il: למד.ה עם

source: Alumni Search Results
he_il: תוצאות חיפוש בוגרים.ות

source: Content
he_il: תוכן

source: Show Rip
he_il: להציג ז"ל

source: Show
he_il: להציג

source: Hide
he_il: להסתיר

source: Non students title
he_il: כותרת ללא תלמידים

source: School Community
he_il: קהילת בית הספר

source: "No Results" text
he_il: כיתוב כשאין תוצאות

source: No people found with that name.
he_il: לא נמצאו בוגרים.ות בשם זה.

source: Class Titles
he_il: כותרת מחזור

source: Typography
he_il: טיפוגרפיה

source: Color
he_il: צבע

source: Alumni Names
he_il: שמות בוגרים.ות

source: RIP Suffix
he_il: סיומת ז"ל

source: Class of
he_il: מחזור

source: Custom Widgets by Effective Web
he_il: ווידג'טים מיוחדים - Effective Web
